#Задание 1 Поработайте с переменными, создайте несколько, выведите на экран, запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.
number = 45
number_1 = "драти"
number_2 = 55
number_3 = "мордати"

print(number)
print(number_1)
print(number_2)
print(number_3)











